# RunGridSettingsDlg

## Description
This procedure will show the grid settings dialog and handle related undo.

```pascal
PROCEDURE RunGridSettingsDlg;
```

```python

def vs.RunGridSettingsDlg():
    return None
```

## Version
Availability: from Vectorworks 2022
## Category
* Document Settings